location_list = {
  '中西區': ['中環', '金鐘', '堅尼地城', '香港大學', '西營盤', '上環', '香港站', '西環','半山','中區','山頂','西半山'],

 '九龍城區': ['九龍塘', '黃埔', '何文田', '土瓜灣', '新蒲崗', '九龍城', '啟德', '馬頭圍'],

 '元朗區': ['落馬洲','天水圍','朗屏','元朗','錦上路','錦田','流浮山','元朗工業區','洪水橋','屏山','新田','八鄉'],

 '北區': ['羅湖', '上水', '粉嶺', '新界北區', '古洞'],

 '南區': ['海洋公園','黃竹坑','利東','海怡半島','薄扶林','淺水灣','田灣','大潭','鴨脷洲','香港仔','石澳','赤柱','華富/華貴','數碼港'],

 '大埔區': ['太和', '大埔墟', '大埔工業邨'],

 '屯門區': ['屯門', '兆康', '屯門區', '藍地', '龍鼓灘'],

 '東區': ['炮台山', '北角', '鰂魚涌', '太古', '西灣河', '筲箕灣', '杏花邨', '柴灣', '東區'],

 '沙田區': ['大學','馬場','火炭','沙田','大圍','車公廟','沙田圍','第一城','石門','大水坑','恆安','馬鞍山','烏溪沙','小瀝源','馬料水'],

 '油尖旺區': ['油麻地','旺角','太子','佐敦','尖沙咀','奧運','九龍站','柯士甸','尖東','紅磡','大角咀','油尖旺區','奧運站'],

 '深水埗區': ['深水埗', '長沙灣', '荔枝角', '美孚', '南昌', '石硤尾', '昂船洲'],

 '灣仔區': ['灣仔', '銅鑼灣', '天后', '大坑', '跑馬地'],

 '荃灣區': ['大窩口', '荃灣', '欣澳', '荃灣西', '迪士尼', '深井', '竹篙灣', "馬灣'"],

 '葵青區': ['荔景', '葵芳', '葵興', '青衣', '荔景', '葵涌', '葵青區', '葵盛'],

 '西貢區': ['油塘', '康城', '寶琳', '坑口', '將軍澳', '調景嶺', '西貢', '清水灣'],

 '觀塘區': ['藍田', '觀塘', '牛頭角', '九龍灣', '油塘', '觀塘區', '秀茂坪'],

 '離島區': ['東涌', '機場', '博覽館', '赤鱲角', '長洲', '愉景灣', '大嶼山區', '梅窩', '南丫島'],

 '黃大仙區': ['樂富', '黃大仙', '鑽石山', '彩虹', '橫頭磡', '慈雲山', '黃大仙區'],

 '全港': ['港九新界',],

 '香港境外': ['內地, 澳門, 海外',]
}
